arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom329p.h
/* Reserved [0xB1] */

#define TCNT2   _SFR_MEM8(0xB2)

#define OCR2A   _SFR_MEM8(0xB3)

/* Reserved [0xB4..0xB5] */

#define ASSR    _SFR_MEM8(0xB6)
#define TCR2UB  0
#define OCR2UB  1
#define TCN2UB  2
#define AS2     3
#define EXCLK   4

/* Reserved [0xB7] */

#define USICR   _SFR_MEM8(0xB8)
#define USITC   0
#define USICLK  1
#define USICS0  2
#define USICS1  3
#define USIWM0  4
#define USIWM1  5
#define USIOIE  6
#define USISIE  7

#define USISR   _SFR_MEM8(0xB9)
#define USICNT0 0
#define USICNT1 1
#define USICNT2 2
#define USICNT3 3
#define USIDC   4
#define USIPF   5
#define USIOIF  6
#define USISIF  7

#define USIDR   _SFR_MEM8(0xBA)

/* Reserved [0xBB..0xBF] */

#define UCSR0A  _SFR_MEM8(0xC0)
#define MPCM0   0
#define U2X0    1
#define UPE0    2
#define DOR0    3
#define FE0     4
#define UDRE0   5
#define TXC0    6
#define RXC0    7

#define UCSR0B  _SFR_MEM8(0xC1)
#define TXB80   0
#define RXB80   1
#define UCSZ02  2
#define TXEN0   3
#define RXEN0   4
#define UDRIE0  5
#define TXCIE0  6
#define RXCIE0  7

#define UCSR0C  _SFR_MEM8(0xC2)
#define UCPOL0  0
#define UCSZ00  1
#define UCSZ01  2
#define USBS0   3
#define UPM00   4
#define UPM01   5
#define UMSEL0  6

/* Reserved [0xC3] */

/* Combine UBRR0L and UBRR0H */
#define UBRR0   _SFR_MEM16(0xC4)

#define UBRR0L  _SFR_MEM8(0xC4)
#define UBRR0H  _SFR_MEM8(0xC5)

#define UDR0    _SFR_MEM8(0xC6)

/* Reserved [0xC7..0xE3] */

#define LCDCRA  _SFR_MEM8(0xE4)
#define LCDBL   0
#define LCDCCD  1
#define LCDBD   2
#define LCDIE   3
#define LCDIF   4
#define LCDAB   6
#define LCDEN   7

#define LCDCRB  _SFR_MEM8(0xE5)
#define LCDPM0  0
#define LCDPM1  1
#define LCDPM2  2
#define LCDPM3  3
#define LCDMUX0 4
#define LCDMUX1 5
#define LCD2B   6
#define LCDCS   7

#define LCDFRR  _SFR_MEM8(0xE6)
#define LCDCD0  0
#define LCDCD1  1
#define LCDCD2  2
#define LCDPS0  4
#define LCDPS1  5
#define LCDPS2  6

#define LCDCCR  _SFR_MEM8(0xE7)
#define LCDCC0  0
#define LCDCC1  1
#define LCDCC2  2
#define LCDCC3  3
#define LCDMDT  4
#define LCDDC0  5
#define LCDDC1  6
#define LCDDC2  7

/* Reserved [0xE8..0xEB] */

#define LCDDR0  _SFR_MEM8(0xEC)
#define SEG000  0
#define SEG001  1
#define SEG002  2
#define SEG003  3
#define SEG004  4
#define SEG005  5
#define SEG006  6
#define SEG007  7

#define LCDDR1  _SFR_MEM8(0xED)
#define SEG008  0
#define SEG009  1
#define SEG010  2
#define SEG011  3
#define SEG012  4
#define SEG013  5
#define SEG014  6
#define SEG015  7

#define LCDDR2  _SFR_MEM8(0xEE)
#define SEG016  0
#define SEG017  1
#define SEG018  2
#define SEG019  3
#define SEG020  4
#define SEG021  5
#define SEG022  6
#define SEG023  7

#define LCDDR3  _SFR_MEM8(0xEF)
#define SEG024  0
#define SEG025  1
#define SEG026  2
#define SEG027  3
#define SEG028  4
#define SEG029  5
#define SEG030  6
#define SEG031  7

/* Reserved [0xF0] */

#define LCDDR5  _SFR_MEM8(0xF1)
#define SEG100  0
#define SEG101  1
#define SEG102  2
#define SEG103  3
#define SEG104  4
#define SEG105  5
#define SEG106  6
#define SEG107  7

#define LCDDR6  _SFR_MEM8(0xF2)
#define SEG108  0
#define SEG109  1
#define SEG110  2
#define SEG111  3
#define SEG112  4
#define SEG113  5
#define SEG114  6
#define SEG115  7

#define LCDDR7  _SFR_MEM8(0xF3)
#define SEG116  0
#define SEG117  1
#define SEG118  2
#define SEG119  3
#define SEG120  4
#define SEG121  5
#define SEG122  6
#define SEG123  7

#define LCDDR8  _SFR_MEM8(0xF4)
#define SEG124  0
#define SEG125  1
#define SEG126  2
#define SEG127  3
#define SEG128  4
#define SEG129  5
#define SEG130  6
#define SEG131  7

/* Reserved [0xF5] */

#define LCDDR10 _SFR_MEM8(0xF6)
#define SEG200  0
#define SEG201  1
#define SEG202  2
#define SEG203  3
#define SEG204  4
#define SEG205  5
#define SEG206  6
#define SEG207  7

#define LCDDR11 _SFR_MEM8(0xF7)
#define SEG208  0
#define SEG209  1
#define SEG210  2
#define SEG211  3
#define SEG212  4
#define SEG213  5
#define SEG214  6
#define SEG215  7

#define LCDDR12 _SFR_MEM8(0xF8)
#define SEG216  0
#define SEG217  1
#define SEG218  2
#define SEG219  3
#define SEG220  4
#define SEG221  5
#define SEG222  6
#define SEG223  7

#define LCDDR13 _SFR_MEM8(0xF9)
#define SEG224  0
#define SEG225  1
#define SEG226  2
#define SEG227  3
#define SEG228  4
#define SEG229  5
#define SEG230  6
#define SEG231  7

/* Reserved [0xFA] */

#define LCDDR15 _SFR_MEM8(0xFB)
#define SEG300  0
#define SEG301  1
#define SEG302  2
#define SEG303  3
#define SEG304  4
#define SEG305  5
#define SEG306  6
#define SEG307  7

#define LCDDR16 _SFR_MEM8(0xFC)
#define SEG308  0
#define SEG309  1
#define SEG310  2
#define SEG311  3
#define SEG312  4
#define SEG313  5
#define SEG314  6
#define SEG315  7

#define LCDDR17 _SFR_MEM8(0xFD)
#define SEG316  0
#define SEG317  1
#define SEG318  2
#define SEG319  3
#define SEG320  4
#define SEG321  5
#define SEG322  6
#define SEG323  7

#define LCDDR18 _SFR_MEM8(0xFE)
#define SEG324  0
#define SEG325  1
#define SEG326  2
#define SEG327  3
#define SEG328  4
#define SEG329  5
#define SEG330  6
#define SEG331  7



/* Values and associated defines */


#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_ADC (0x01<<1)
#define SLEEP_MODE_PWR_DOWN (0x02<<1)
#define SLEEP_MODE_PWR_SAVE (0x03<<1)
#define SLEEP_MODE_STANDBY (0x06<<1)

/* Interrupt vectors */
/* Vector 0 is the reset vector */
/* External Interrupt Request 0 */
#define INT0_vect            _VECTOR(1)
#define INT0_vect_num        1

/* Pin Change Interrupt Request 0 */
#define PCINT0_vect            _VECTOR(2)
#define PCINT0_vect_num        2

/* Pin Change Interrupt Request 1 */
#define PCINT1_vect            _VECTOR(3)
#define PCINT1_vect_num        3

/* Timer/Counter2 Compare Match */
#define TIMER2_COMP_vect            _VECTOR(4)
#define TIMER2_COMP_vect_num        4

/* Timer/Counter2 Overflow */
#define TIMER2_OVF_vect            _VECTOR(5)
#define TIMER2_OVF_vect_num        5

/* Timer/Counter1 Capture Event */
#define TIMER1_CAPT_vect            _VECTOR(6)
#define TIMER1_CAPT_vect_num        6

/* Timer/Counter1 Compare Match A */
#define TIMER1_COMPA_vect            _VECTOR(7)
#define TIMER1_COMPA_vect_num        7

/* Timer/Counter Compare Match B */
#define TIMER1_COMPB_vect            _VECTOR(8)
#define TIMER1_COMPB_vect_num        8

/* Timer/Counter1 Overflow */
#define TIMER1_OVF_vect            _VECTOR(9)
#define TIMER1_OVF_vect_num        9

/* Timer/Counter0 Compare Match */
#define TIMER0_COMP_vect            _VECTOR(10)
#define TIMER0_COMP_vect_num        10

