arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom329p.h
/* Timer/Counter0 Overflow */
#define TIMER0_OVF_vect            _VECTOR(11)
#define TIMER0_OVF_vect_num        11

/* SPI Serial Transfer Complete */
#define SPI_STC_vect            _VECTOR(12)
#define SPI_STC_vect_num        12

/* USART0, Rx Complete */
#define USART0_RX_vect            _VECTOR(13)
#define USART0_RX_vect_num        13

/* USART0 Data register Empty */
#define USART0_UDRE_vect            _VECTOR(14)
#define USART0_UDRE_vect_num        14

/* USART0, Tx Complete */
#define USART0_TX_vect            _VECTOR(15)
#define USART0_TX_vect_num        15

/* USI Start Condition */
#define USI_START_vect            _VECTOR(16)
#define USI_START_vect_num        16

/* USI Overflow */
#define USI_OVERFLOW_vect            _VECTOR(17)
#define USI_OVERFLOW_vect_num        17

/* Analog Comparator */
#define ANALOG_COMP_vect            _VECTOR(18)
#define ANALOG_COMP_vect_num        18

/* ADC Conversion Complete */
#define ADC_vect            _VECTOR(19)
#define ADC_vect_num        19

/* EEPROM Ready */
#define EE_READY_vect            _VECTOR(20)
#define EE_READY_vect_num        20

/* Store Program Memory Read */
#define SPM_READY_vect            _VECTOR(21)
#define SPM_READY_vect_num        21

/* LCD Start of Frame */
#define LCD_vect            _VECTOR(22)
#define LCD_vect_num        22

#define _VECTORS_SIZE 92


/* Constants */

#define SPM_PAGESIZE 128
#define FLASHSTART   0x0000
#define FLASHEND     0x7FFF
#define RAMSTART     0x0100
#define RAMSIZE      2048
#define RAMEND       0x08FF
#define E2START     0
#define E2SIZE      1024
#define E2PAGESIZE  4
#define E2END       0x03FF
#define XRAMEND      RAMEND


/* Fuses */

#define FUSE_MEMORY_SIZE 3

/* Low Fuse Byte */
#define FUSE_SUT_CKSEL0  (unsigned char)~_BV(0)
#define FUSE_SUT_CKSEL1  (unsigned char)~_BV(1)
#define FUSE_SUT_CKSEL2  (unsigned char)~_BV(2)
#define FUSE_SUT_CKSEL3  (unsigned char)~_BV(3)
#define FUSE_SUT_CKSEL4  (unsigned char)~_BV(4)
#define FUSE_SUT_CKSEL5  (unsigned char)~_BV(5)
#define FUSE_CKOUT       (unsigned char)~_BV(6)
#define FUSE_CKDIV8      (unsigned char)~_BV(7)
#define LFUSE_DEFAULT    (FUSE_SUT_CKSEL0 & FUSE_SUT_CKSEL2 & FUSE_SUT_CKSEL3 & FUSE_SUT_CKSEL4 & FUSE_CKDIV8)


/* High Fuse Byte */
#define FUSE_BOOTRST     (unsigned char)~_BV(0)
#define FUSE_BOOTSZ0     (unsigned char)~_BV(1)
#define FUSE_BOOTSZ1     (unsigned char)~_BV(2)
#define FUSE_EESAVE      (unsigned char)~_BV(3)
#define FUSE_WDTON       (unsigned char)~_BV(4)
#define FUSE_SPIEN       (unsigned char)~_BV(5)
#define FUSE_JTAGEN      (unsigned char)~_BV(6)
#define FUSE_OCDEN       (unsigned char)~_BV(7)
#define HFUSE_DEFAULT    (FUSE_BOOTSZ0 & FUSE_BOOTSZ1 & FUSE_SPIEN & FUSE_JTAGEN)


/* Extended Fuse Byte */
#define FUSE_RSTDISBL    (unsigned char)~_BV(0)
#define FUSE_BODLEVEL0   (unsigned char)~_BV(1)
#define FUSE_BODLEVEL1   (unsigned char)~_BV(2)
#define EFUSE_DEFAULT    (0xFF)



/* Lock Bits */
#define __LOCK_BITS_EXIST
#define __BOOT_LOCK_BITS_0_EXIST
#define __BOOT_LOCK_BITS_1_EXIST


/* Signature */
#define SIGNATURE_0 0x1E
#define SIGNATURE_1 0x95
#define SIGNATURE_2 0x0B


#endif /* #ifdef _AVR_ATMEGA329P_H_INCLUDED */

